{"class_name": "Model", "keras_version": "1.1.0", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "input_dtype": "float32", "name": "input_1"}}, {"name": "zeropadding2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [3, 3], "name": "zeropadding2d_1"}}, {"name": "conv1", "inbound_nodes": [[["zeropadding2d_1", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 7, "init": "glorot_uniform", "trainable": true, "nb_row": 7, "dim_ordering": "tf", "W_constraint": null, "name": "conv1", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 64, "subsample": [2, 2]}}, {"name": "bn_conv1", "inbound_nodes": [[["conv1", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn_conv1", "trainable": true, "momentum": 0.99}}, {"name": "activation_1", "inbound_nodes": [[["bn_conv1", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"name": "maxpooling2d_1", "inbound_nodes": [[["activation_1", 0, 0]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [3, 3], "name": "maxpooling2d_1", "border_mode": "valid"}}, {"name": "res2a_branch2a", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res2a_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 64, "subsample": [1, 1]}}, {"name": "bn2a_branch2a", "inbound_nodes": [[["res2a_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn2a_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_2", "inbound_nodes": [[["bn2a_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"name": "res2a_branch2b", "inbound_nodes": [[["activation_2", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res2a_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 64, "subsample": [1, 1]}}, {"name": "bn2a_branch2b", "inbound_nodes": [[["res2a_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn2a_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_3", "inbound_nodes": [[["bn2a_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"name": "res2a_branch2c", "inbound_nodes": [[["activation_3", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res2a_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "res2a_branch1", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res2a_branch1", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn2a_branch2c", "inbound_nodes": [[["res2a_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn2a_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "bn2a_branch1", "inbound_nodes": [[["res2a_branch1", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn2a_branch1", "trainable": true, "momentum": 0.99}}, {"name": "merge_1", "inbound_nodes": [[["bn2a_branch2c", 0, 0], ["bn2a_branch1", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_1", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_4", "inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"name": "res2b_branch2a", "inbound_nodes": [[["activation_4", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res2b_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 64, "subsample": [1, 1]}}, {"name": "bn2b_branch2a", "inbound_nodes": [[["res2b_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn2b_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_5", "inbound_nodes": [[["bn2b_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"name": "res2b_branch2b", "inbound_nodes": [[["activation_5", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res2b_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 64, "subsample": [1, 1]}}, {"name": "bn2b_branch2b", "inbound_nodes": [[["res2b_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn2b_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_6", "inbound_nodes": [[["bn2b_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"name": "res2b_branch2c", "inbound_nodes": [[["activation_6", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res2b_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn2b_branch2c", "inbound_nodes": [[["res2b_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn2b_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "merge_2", "inbound_nodes": [[["bn2b_branch2c", 0, 0], ["activation_4", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_2", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_7", "inbound_nodes": [[["merge_2", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"name": "res2c_branch2a", "inbound_nodes": [[["activation_7", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res2c_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 64, "subsample": [1, 1]}}, {"name": "bn2c_branch2a", "inbound_nodes": [[["res2c_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn2c_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_8", "inbound_nodes": [[["bn2c_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"name": "res2c_branch2b", "inbound_nodes": [[["activation_8", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res2c_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 64, "subsample": [1, 1]}}, {"name": "bn2c_branch2b", "inbound_nodes": [[["res2c_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn2c_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_9", "inbound_nodes": [[["bn2c_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"name": "res2c_branch2c", "inbound_nodes": [[["activation_9", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res2c_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn2c_branch2c", "inbound_nodes": [[["res2c_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn2c_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "merge_3", "inbound_nodes": [[["bn2c_branch2c", 0, 0], ["activation_7", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_3", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_10", "inbound_nodes": [[["merge_3", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"name": "res3a_branch2a", "inbound_nodes": [[["activation_10", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res3a_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 128, "subsample": [2, 2]}}, {"name": "bn3a_branch2a", "inbound_nodes": [[["res3a_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3a_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_11", "inbound_nodes": [[["bn3a_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"name": "res3a_branch2b", "inbound_nodes": [[["activation_11", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res3a_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 128, "subsample": [1, 1]}}, {"name": "bn3a_branch2b", "inbound_nodes": [[["res3a_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3a_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_12", "inbound_nodes": [[["bn3a_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}}, {"name": "res3a_branch2c", "inbound_nodes": [[["activation_12", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res3a_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 512, "subsample": [1, 1]}}, {"name": "res3a_branch1", "inbound_nodes": [[["activation_10", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res3a_branch1", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 512, "subsample": [2, 2]}}, {"name": "bn3a_branch2c", "inbound_nodes": [[["res3a_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3a_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "bn3a_branch1", "inbound_nodes": [[["res3a_branch1", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3a_branch1", "trainable": true, "momentum": 0.99}}, {"name": "merge_4", "inbound_nodes": [[["bn3a_branch2c", 0, 0], ["bn3a_branch1", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_4", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_13", "inbound_nodes": [[["merge_4", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}}, {"name": "res3b_branch2a", "inbound_nodes": [[["activation_13", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res3b_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 128, "subsample": [1, 1]}}, {"name": "bn3b_branch2a", "inbound_nodes": [[["res3b_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3b_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_14", "inbound_nodes": [[["bn3b_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}}, {"name": "res3b_branch2b", "inbound_nodes": [[["activation_14", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res3b_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 128, "subsample": [1, 1]}}, {"name": "bn3b_branch2b", "inbound_nodes": [[["res3b_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3b_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_15", "inbound_nodes": [[["bn3b_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}}, {"name": "res3b_branch2c", "inbound_nodes": [[["activation_15", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res3b_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 512, "subsample": [1, 1]}}, {"name": "bn3b_branch2c", "inbound_nodes": [[["res3b_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3b_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "merge_5", "inbound_nodes": [[["bn3b_branch2c", 0, 0], ["activation_13", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_5", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_16", "inbound_nodes": [[["merge_5", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}}, {"name": "res3c_branch2a", "inbound_nodes": [[["activation_16", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res3c_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 128, "subsample": [1, 1]}}, {"name": "bn3c_branch2a", "inbound_nodes": [[["res3c_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3c_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_17", "inbound_nodes": [[["bn3c_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}}, {"name": "res3c_branch2b", "inbound_nodes": [[["activation_17", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res3c_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 128, "subsample": [1, 1]}}, {"name": "bn3c_branch2b", "inbound_nodes": [[["res3c_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3c_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_18", "inbound_nodes": [[["bn3c_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}}, {"name": "res3c_branch2c", "inbound_nodes": [[["activation_18", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res3c_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 512, "subsample": [1, 1]}}, {"name": "bn3c_branch2c", "inbound_nodes": [[["res3c_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3c_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "merge_6", "inbound_nodes": [[["bn3c_branch2c", 0, 0], ["activation_16", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_6", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_19", "inbound_nodes": [[["merge_6", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}}, {"name": "res3d_branch2a", "inbound_nodes": [[["activation_19", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res3d_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 128, "subsample": [1, 1]}}, {"name": "bn3d_branch2a", "inbound_nodes": [[["res3d_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3d_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_20", "inbound_nodes": [[["bn3d_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}}, {"name": "res3d_branch2b", "inbound_nodes": [[["activation_20", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res3d_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 128, "subsample": [1, 1]}}, {"name": "bn3d_branch2b", "inbound_nodes": [[["res3d_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3d_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_21", "inbound_nodes": [[["bn3d_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_21", "activation": "relu"}}, {"name": "res3d_branch2c", "inbound_nodes": [[["activation_21", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res3d_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 512, "subsample": [1, 1]}}, {"name": "bn3d_branch2c", "inbound_nodes": [[["res3d_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn3d_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "merge_7", "inbound_nodes": [[["bn3d_branch2c", 0, 0], ["activation_19", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_7", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_22", "inbound_nodes": [[["merge_7", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_22", "activation": "relu"}}, {"name": "res4a_branch2a", "inbound_nodes": [[["activation_22", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4a_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 256, "subsample": [2, 2]}}, {"name": "bn4a_branch2a", "inbound_nodes": [[["res4a_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4a_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_23", "inbound_nodes": [[["bn4a_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_23", "activation": "relu"}}, {"name": "res4a_branch2b", "inbound_nodes": [[["activation_23", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res4a_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn4a_branch2b", "inbound_nodes": [[["res4a_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4a_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_24", "inbound_nodes": [[["bn4a_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_24", "activation": "relu"}}, {"name": "res4a_branch2c", "inbound_nodes": [[["activation_24", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4a_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 1024, "subsample": [1, 1]}}, {"name": "res4a_branch1", "inbound_nodes": [[["activation_22", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4a_branch1", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 1024, "subsample": [2, 2]}}, {"name": "bn4a_branch2c", "inbound_nodes": [[["res4a_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4a_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "bn4a_branch1", "inbound_nodes": [[["res4a_branch1", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4a_branch1", "trainable": true, "momentum": 0.99}}, {"name": "merge_8", "inbound_nodes": [[["bn4a_branch2c", 0, 0], ["bn4a_branch1", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_8", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_25", "inbound_nodes": [[["merge_8", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_25", "activation": "relu"}}, {"name": "res4b_branch2a", "inbound_nodes": [[["activation_25", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4b_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn4b_branch2a", "inbound_nodes": [[["res4b_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4b_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_26", "inbound_nodes": [[["bn4b_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_26", "activation": "relu"}}, {"name": "res4b_branch2b", "inbound_nodes": [[["activation_26", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res4b_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn4b_branch2b", "inbound_nodes": [[["res4b_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4b_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_27", "inbound_nodes": [[["bn4b_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_27", "activation": "relu"}}, {"name": "res4b_branch2c", "inbound_nodes": [[["activation_27", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4b_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 1024, "subsample": [1, 1]}}, {"name": "bn4b_branch2c", "inbound_nodes": [[["res4b_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4b_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "merge_9", "inbound_nodes": [[["bn4b_branch2c", 0, 0], ["activation_25", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_9", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_28", "inbound_nodes": [[["merge_9", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_28", "activation": "relu"}}, {"name": "res4c_branch2a", "inbound_nodes": [[["activation_28", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4c_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn4c_branch2a", "inbound_nodes": [[["res4c_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4c_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_29", "inbound_nodes": [[["bn4c_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_29", "activation": "relu"}}, {"name": "res4c_branch2b", "inbound_nodes": [[["activation_29", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res4c_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn4c_branch2b", "inbound_nodes": [[["res4c_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4c_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_30", "inbound_nodes": [[["bn4c_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_30", "activation": "relu"}}, {"name": "res4c_branch2c", "inbound_nodes": [[["activation_30", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4c_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 1024, "subsample": [1, 1]}}, {"name": "bn4c_branch2c", "inbound_nodes": [[["res4c_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4c_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "merge_10", "inbound_nodes": [[["bn4c_branch2c", 0, 0], ["activation_28", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_10", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_31", "inbound_nodes": [[["merge_10", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_31", "activation": "relu"}}, {"name": "res4d_branch2a", "inbound_nodes": [[["activation_31", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4d_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn4d_branch2a", "inbound_nodes": [[["res4d_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4d_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_32", "inbound_nodes": [[["bn4d_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_32", "activation": "relu"}}, {"name": "res4d_branch2b", "inbound_nodes": [[["activation_32", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res4d_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn4d_branch2b", "inbound_nodes": [[["res4d_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4d_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_33", "inbound_nodes": [[["bn4d_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_33", "activation": "relu"}}, {"name": "res4d_branch2c", "inbound_nodes": [[["activation_33", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4d_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 1024, "subsample": [1, 1]}}, {"name": "bn4d_branch2c", "inbound_nodes": [[["res4d_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4d_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "merge_11", "inbound_nodes": [[["bn4d_branch2c", 0, 0], ["activation_31", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_11", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_34", "inbound_nodes": [[["merge_11", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_34", "activation": "relu"}}, {"name": "res4e_branch2a", "inbound_nodes": [[["activation_34", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4e_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn4e_branch2a", "inbound_nodes": [[["res4e_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4e_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_35", "inbound_nodes": [[["bn4e_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_35", "activation": "relu"}}, {"name": "res4e_branch2b", "inbound_nodes": [[["activation_35", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res4e_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn4e_branch2b", "inbound_nodes": [[["res4e_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4e_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_36", "inbound_nodes": [[["bn4e_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_36", "activation": "relu"}}, {"name": "res4e_branch2c", "inbound_nodes": [[["activation_36", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4e_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 1024, "subsample": [1, 1]}}, {"name": "bn4e_branch2c", "inbound_nodes": [[["res4e_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4e_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "merge_12", "inbound_nodes": [[["bn4e_branch2c", 0, 0], ["activation_34", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_12", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_37", "inbound_nodes": [[["merge_12", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_37", "activation": "relu"}}, {"name": "res4f_branch2a", "inbound_nodes": [[["activation_37", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4f_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn4f_branch2a", "inbound_nodes": [[["res4f_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4f_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_38", "inbound_nodes": [[["bn4f_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_38", "activation": "relu"}}, {"name": "res4f_branch2b", "inbound_nodes": [[["activation_38", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res4f_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1]}}, {"name": "bn4f_branch2b", "inbound_nodes": [[["res4f_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4f_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_39", "inbound_nodes": [[["bn4f_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_39", "activation": "relu"}}, {"name": "res4f_branch2c", "inbound_nodes": [[["activation_39", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res4f_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 1024, "subsample": [1, 1]}}, {"name": "bn4f_branch2c", "inbound_nodes": [[["res4f_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn4f_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "merge_13", "inbound_nodes": [[["bn4f_branch2c", 0, 0], ["activation_37", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_13", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_40", "inbound_nodes": [[["merge_13", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_40", "activation": "relu"}}, {"name": "res5a_branch2a", "inbound_nodes": [[["activation_40", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res5a_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 512, "subsample": [2, 2]}}, {"name": "bn5a_branch2a", "inbound_nodes": [[["res5a_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn5a_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_41", "inbound_nodes": [[["bn5a_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_41", "activation": "relu"}}, {"name": "res5a_branch2b", "inbound_nodes": [[["activation_41", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res5a_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 512, "subsample": [1, 1]}}, {"name": "bn5a_branch2b", "inbound_nodes": [[["res5a_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn5a_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_42", "inbound_nodes": [[["bn5a_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_42", "activation": "relu"}}, {"name": "res5a_branch2c", "inbound_nodes": [[["activation_42", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res5a_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 2048, "subsample": [1, 1]}}, {"name": "res5a_branch1", "inbound_nodes": [[["activation_40", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res5a_branch1", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 2048, "subsample": [2, 2]}}, {"name": "bn5a_branch2c", "inbound_nodes": [[["res5a_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn5a_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "bn5a_branch1", "inbound_nodes": [[["res5a_branch1", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn5a_branch1", "trainable": true, "momentum": 0.99}}, {"name": "merge_14", "inbound_nodes": [[["bn5a_branch2c", 0, 0], ["bn5a_branch1", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_14", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_43", "inbound_nodes": [[["merge_14", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_43", "activation": "relu"}}, {"name": "res5b_branch2a", "inbound_nodes": [[["activation_43", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res5b_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 512, "subsample": [1, 1]}}, {"name": "bn5b_branch2a", "inbound_nodes": [[["res5b_branch2a", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn5b_branch2a", "trainable": true, "momentum": 0.99}}, {"name": "activation_44", "inbound_nodes": [[["bn5b_branch2a", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_44", "activation": "relu"}}, {"name": "res5b_branch2b", "inbound_nodes": [[["activation_44", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "name": "res5b_branch2b", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 512, "subsample": [1, 1]}}, {"name": "bn5b_branch2b", "inbound_nodes": [[["res5b_branch2b", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn5b_branch2b", "trainable": true, "momentum": 0.99}}, {"name": "activation_45", "inbound_nodes": [[["bn5b_branch2b", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_45", "activation": "relu"}}, {"name": "res5b_branch2c", "inbound_nodes": [[["activation_45", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res5b_branch2c", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 2048, "subsample": [1, 1]}}, {"name": "bn5b_branch2c", "inbound_nodes": [[["res5b_branch2c", 0, 0]]], "class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "axis": 3, "name": "bn5b_branch2c", "trainable": true, "momentum": 0.99}}, {"name": "merge_15", "inbound_nodes": [[["bn5b_branch2c", 0, 0], ["activation_43", 0, 0]]], "class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_15", "output_shape": null, "mode_type": "raw"}}, {"name": "activation_46", "inbound_nodes": [[["merge_15", 0, 0]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_46", "activation": "relu"}}, {"name": "res5c_branch2a", "inbound_nodes": [[["activation_46", 0, 0]]], "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_constraint": null, "name": "res5c_branch2a", "bias": true, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 512, "subsample": [1, 1]}}, {"name": "bn5c_branch2a", "inbound_nodes": 